uhnp/src/InformationRegisters/СведенияОбИзмененииДокументов/СведенияОбИзмененииДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОбИзмененииДокументов</name>
  <resources>
    <name>ПоследнийРедактировавший</name>
    <comment>Пользователь, внесший последние изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.КорректировкаЗначенийПоказателей</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
      <types>DocumentRef.НастраиваемыйОтчет</types>
      <types>DocumentRef.Элиминация</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СведенияОбИзмененииДокументов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСведения(ТекущийОбъект) Экспорт
	
	Сведения = Новый Структура;
	Сведения.Вставить("ПоследнийРедактировавший", Справочники.Пользователи.ПустаяСсылка());
	Сведения.Вставить("ДатаИзменения", Дата(1, 1, 1));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОбИзмененииДокументов.ПоследнийРедактировавший КАК ПоследнийРедактировавший,
		|	СведенияОбИзмененииДокументов.ДатаИзменения КАК ДатаИзменения
		|ИЗ
		|	РегистрСведений.СведенияОбИзмененииДокументов КАК СведенияОбИзмененииДокументов
		|ГДЕ
		|	СведенияОбИзмененииДокументов.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", ТекущийОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		ЗаполнитьЗначенияСвойств(Сведения, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат Сведения
	
КонецФункции

#КонецОбласти

#КонецЕсли
